"Close" = "Sluiten";

"Scan Card" = "Kaart scannen";

"Scan card" = "Betaalkaart scannen";

"The IBAN you entered is invalid." = "Het opgegeven IBAN-nummer is ongeldig.";

"There was an error processing your card -- try again in a few seconds" = "Er is een fout met de verwerking van je kaart. Probeer het over enkele seconden opnieuw";

"There was an unexpected error -- try again in a few seconds" = "Er is een onverwachte fout opgetreden. Probeer het over enkele seconden opnieuw";

"Try again" = "Opnieuw proberen";

"We use Stripe to verify your card details. Stripe may use and store your data according its privacy policy. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Learn more</u></a>" = "We gebruiken Stripe om je kaartgegevens te verifiëren. Stripe kan je gegevens gebruiken en bewaren volgens hun privacybeleid. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Meer informatie</u></a>";

"Your card has expired" = "Je kaart is vervallen";

"Your card was declined" = "Je kaart is geweigerd";

"Your card's expiration month is invalid" = "De vervalmaand van je kaart is ongeldig";

"Your card's expiration year is invalid" = "Het vervaljaar van je kaart is ongeldig";

"Your card's number is invalid" = "Je kaartnummer is ongeldig";

"Your card's security code is invalid" = "De beveiligingscode van je kaart is ongeldig";

"Your name is invalid." = "Je naam is ongeldig.";

"Your payment method was declined." = "Je betaalmethode is geweigerd.";
